tap "homebrew/bundle"
tap "homebrew/services"
tap "th-ch/youtube-music"
tap "tophat/bar"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.13"
brew "glib"
brew "bash"
brew "bc"
brew "btop"
brew "chrome-cli"
brew "coreutils"
brew "fish"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-now"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "gobject-introspection"
brew "gpgme"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libfido2"
brew "libyaml"
brew "lsd"
brew "mise"
brew "mysql"
brew "nginx"
brew "nkf"
brew "node"
brew "node-build"
brew "nodenv"
brew "nowplaying-cli"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "peco"
brew "pgformatter"
brew "pipx"
brew "pngquant"
brew "poppler"
brew "postgresql@14"
brew "python@3.11"
brew "ragel"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "spin"
brew "tfenv"
brew "tflint"
brew "tig"
brew "vips"
brew "wget"
brew "tophat/bar/yvm"
cask "amethyst"
cask "emacs"
cask "flameshot"
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
cask "inkscape"
cask "libreoffice"
cask "youtube-music"
cask "zed@preview"
vscode "benbusby.earthbound-themes"
vscode "bierner.markdown-mermaid"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "canhminhdo.cafeobj"
vscode "corschenzi.mermaid-graphical-editor"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-office"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dsvictor94.promela"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hb432.undertale-act-theme"
vscode "hediet.vscode-drawio"
vscode "icrawl.discord-vscode"
vscode "itarato.byesig"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jduponchelle.rainbow-end"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "kukushi.pasteurl"
vscode "leetcode.vscode-leetcode"
vscode "lfs.vscode-emacs-friendly"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mushan.vscode-paste-image"
vscode "oderwat.indent-rainbow"
vscode "pentium10.vscode-gcp-project-switcher"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "runtimeverification.k-vscode"
vscode "rust-lang.rust-analyzer"
vscode "s_sasaki_0529.tatami-vscode-extension"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shadowenv"
vscode "sianglim.slim"
vscode "skyapps.fish-vscode"
vscode "sorbet.sorbet-vscode-extension"
vscode "sporto.rails-go-to-spec"
vscode "starkwang.markdown"
vscode "stefanjarina.vscode-eex-snippets"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "taizod1024.ac-ts-extension"
vscode "tamasfe.even-better-toml"
vscode "theumletteam.umlet"
vscode "tomoki1207.pdf"
vscode "tuttieee.emacs-mcx"
vscode "twxs.cmake"
vscode "undefined_publisher.monjo-link-inserter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zakcodes.rust-snippets"
